{
  "compartments_configuration": {
    "enable_delete": "true",
    "compartments": {
      "CMP-LANDINGZONE-P-KEY": {
        "name": "cmp-landingzone-peter",
        "description": "Enclosing Production Landing Zone Compartment",
        "children": {
          "CMP-LZP-NETWORK-KEY": {
            "name": "cmp-lzp-network",
            "description": "Shared Network Compartment"
          },
          "CMP-LZP-RAD-KEY": {
            "name": "cmp-lzp-rad",
            "description": "R&D Environment Compartment"
          }
        }
      }
    }
  },
  "groups_configuration": {
    "groups": {
      "GRP-IAM-ADMINS": {
        "name": "grp-iam-admins",
        "description": "Tenancy global Identity and access management administrator group."
      },
      "GRP-CREDENTIAL-ADMINS": {
        "name": "grp-credential-admins",
        "description": "Tenancy global credential administrator group."
      },
      "GRP-ANNOUNCEMENT-READERS": {
        "name": "grp-announcement-readers",
        "description": "Tenancy global readers of OCI monitoring information group."
      },
      "GRP-COST-ADMINS": {
        "name": "grp-cost-admins",
        "description": "Tenancy global cost control group."
      },
      "GRP-AUDITORS": {
        "name": "grp-auditors",
        "description": "Tenancy global read access group(for security auditing or health checks)."
      },
      "GRP-SECURITY-ADMINS": {
        "name": "grp-security-admins",
        "description": "Tenancy Security Administrators for global resources as Cloud Guard."
      },
      "GRP-LZP-IAM-ADMINS": {
        "name": "grp-lzp-iam-admins",
        "description": "Production Landing Zone Environment Identity and access management administrator group."
      },
      "GRP-LZP-NETWORK-ADMINS": {
        "name": "grp-lzp-network-admins",
        "description": "Production Landing Zone Environment shared network administration group, including common OE network elements."
      },
      "GRP-LZP-RAD-IAM-ADMINS": {
        "name": "grp-lzp-prod-iam-admins",
        "description": "Production Landing Zone Environment Production environment IAM administrator."
      },
      "GRP-LZP-RAD-NETWORK-ADMINS": {
        "name": "grp-lzp-prod-network-admins",
        "description": "Production Landing Zone Environment, Production environment, network administration group."
      }
    }
  },
  "policies_configuration": {
    "enable_cis_benchmark_checks": "false",
    "supplied_policies": {
      "PCY-LZP-IAM-ADMINISTRATION": {
        "name": "pcy-lzp-iam-administration",
        "description": "Policy to allow grp-lzp-iam-admins group users to manage IAM resoures in the Landing Zone Production environment.",
        "compartment_id": "TENANCY-ROOT",
        "statements": [
          "allow group grp-iam-admins to manage policies in compartment cmp-landingzone-p",
          "allow group grp-iam-admins to manage compartments in compartment cmp-landingzone-p"
        ]
      },
      "PCY-LZP-NETWORK-ADMINISTRATION": {
        "name": "pcy-lzp-network-administration",
        "description": "Policy which allows grp-lzp-network-admins group users to manage all network resources in the compartment cmp-landingzone-p:cmp-lzp-network.",
        "compartment_id": "TENANCY-ROOT",
        "statements": [
          "allow group grp-lzp-network-admins to use cloud-shell in tenancy",
          "allow group grp-lzp-network-admins to read usage-budgets in tenancy",
          "allow group grp-lzp-network-admins to read usage-reports in tenancy",
          "allow group grp-lzp-network-admins to read objectstorage-namespaces in tenancy",
          "allow group grp-lzp-network-admins to read all-resources in compartment cmp-landingzone-p:cmp-lzp-network",
          "allow group grp-lzp-network-admins to manage virtual-network-family in compartment cmp-landingzone-p:cmp-lzp-network",
          "allow group grp-lzp-network-admins to manage dns in compartment cmp-landingzone-p:cmp-lzp-network",
          "allow group grp-lzp-network-admins to manage load-balancers in compartment cmp-landingzone-p:cmp-lzp-network",
          "allow group grp-lzp-network-admins to manage alarms in compartment cmp-landingzone-p:cmp-lzp-network",
          "allow group grp-lzp-network-admins to manage metrics in compartment cmp-landingzone-p:cmp-lzp-network",
          "allow group grp-lzp-network-admins to read ons-topics in compartment cmp-landingzone-p:cmp-lzp-security",
          "allow group grp-lzp-network-admins to manage orm-stacks in compartment cmp-landingzone-p:cmp-lzp-network",
          "allow group grp-lzp-network-admins to manage orm-jobs in compartment cmp-landingzone-p:cmp-lzp-network",
          "allow group grp-lzp-network-admins to manage orm-config-source-providers in compartment cmp-landingzone-p:cmp-lzp-network",
          "allow group grp-lzp-network-admins to read audit-events in compartment cmp-landingzone-p:cmp-lzp-network",
          "allow group grp-lzp-network-admins to read work-requests in compartment cmp-landingzone-p:cmp-lzp-network",
          "allow group grp-lzp-network-admins to manage instance-family in compartment cmp-landingzone-p:cmp-lzp-network",
          "allow group grp-lzp-network-admins to manage volume-family in compartment cmp-landingzone-p:cmp-lzp-network where all{request.permission != 'VOLUME_BACKUP_DELETE', request.permission != 'VOLUME_DELETE', request.permission != 'BOOT_VOLUME_BACKUP_DELETE'}",
          "allow group grp-lzp-network-admins to manage object-family in compartment cmp-landingzone-p:cmp-lzp-network where all{request.permission != 'OBJECT_DELETE', request.permission != 'BUCKET_DELETE'}",
          "allow group grp-lzp-network-admins to manage file-family in compartment cmp-landingzone-p:cmp-lzp-network where all{request.permission != 'FILE_SYSTEM_DELETE', request.permission != 'MOUNT_TARGET_DELETE', request.permission != 'EXPORT_SET_DELETE', request.permission != 'FILE_SYSTEM_DELETE_SNAPSHOT', request.permission != 'FILE_SYSTEM_NFSv3_UNEXPORT'}",
          "allow group grp-lzp-network-admins to manage bastion-session in compartment cmp-landingzone-p:cmp-lzp-network",
          "allow group grp-lzp-network-admins to manage cloudevents-rules in compartment cmp-landingzone-p:cmp-lzp-network",
          "allow group grp-lzp-network-admins to read instance-agent-plugins in compartment cmp-landingzone-p:cmp-lzp-network",
          "allow group grp-lzp-network-admins to manage keys in compartment cmp-landingzone-p:cmp-lzp-network",
          "allow group grp-lzp-network-admins to use key-delegate in compartment cmp-landingzone-p:cmp-lzp-network",
          "allow group grp-lzp-network-admins to manage secret-family in compartment cmp-landingzone-p:cmp-lzp-network",
          "allow group grp-lzp-network-admins to manage repos in compartment cmp-landingzone-p:cmp-lzp-network",
          "allow group grp-lzp-network-admins to read vss-family in compartment cmp-landingzone-p:cmp-lzp-network",
          "allow group grp-lzp-network-admins to use bastion in compartment cmp-landingzone-p:cmp-lzp-security",
          "allow group grp-lzp-network-admins to use bastion-session in compartment cmp-landingzone-p:cmp-lzp-security",
          "allow group grp-lzp-network-admins to use vaults in compartment cmp-landingzone-p:cmp-lzp-security",
          "allow group grp-lzp-network-admins to read logging-family in compartment cmp-landingzone-p:cmp-lzp-security"
        ]
      },
      "PCY-LZP-RAD-IAM-ADMINISTRATION": {
        "name": "pcy-lzp-prod-iam-administration",
        "description": "Policy to allow grp-lzp-prod-iam-admins group users to manage IAM resoures in the Landing Zone Production environment, Prod Environment.",
        "compartment_id": "TENANCY-ROOT",
        "statements": [
          "allow group grp-lzp-prod-iam-admins to manage policies in compartment cmp-landingzone-p:cmp-lzp-rad",
          "allow group grp-lzp-prod-iam-admins to manage compartments in compartment cmp-landingzone-p:cmp-lzp-rad"
        ]
      }
    }
  }
}
